// 把n个骰子扔在地上，所有骰子朝上一面的点数之和为s。输入n，打印出s的所有可能的值出现的概率。
//
// 你需要用一个浮点数数组返回答案，
// 其中第 i 个元素代表这 n 个骰子所能掷出的点数集合中第 i 小的那个的概率。
//
// 输入: 2
// 输出:
// [0.02778,0.05556,0.08333,0.11111,0.13889,
// 0.16667,0.13889,0.11111,0.08333,0.05556,0.02778]
//
#include <vector>
using std::vector;
class Solution {
 public:
  vector<double> dicesProbability(int n) {
    // 初始是1个骰子情况下的点数之和情况，就只有6个结果，所以用dp的初始化的size是6个
    vector<double> dp(6, 1.0 / 6.0);
    for (int i = 2; i <= n; i++) {
      // 每次的点数之和范围会有点变化，点数之和的值最大是i*6，最小是i*1，i之前的结果值是不会出现的；
      // 比如i=3个骰子时，最小就是3了，不可能是2和1，所以点数之和的值的个数是6*i-(i-1)，化简：5*i+1
      vector<double> tmp(5 * i + 1, 0);
      // 先拿i-1个骰子的点数之和数组的第j个值，它所影响的是i个骰子时的temp[j+k]的值
      for (int j = 0; j < dp.size(); j++) {
        // 比如只有1个骰子时，dp[1]是代表当骰子点数之和为2时的概率，
        // 它会对当有2个骰子时的点数之和为3、4、5、6、7、8产生影响，
        // 因为当有一个骰子的值为2时，另一个骰子的值可以为1~6，
        // 产生的点数之和相应的就是3~8；比如dp[2]代表点数之和为3，
        // 它会对有2个骰子时的点数之和为4、5、6、7、8、9产生影响；
        // 所以k在这里就是对应着第i个骰子出现时可能出现六种情况，
        // 这里可能画一个K神那样的动态规划逆推的图就好理解很多
        for (int k = 0; k < 6; k++) {
          // 这里记得是加上dp数组值与1/6的乘积，1/6是第i个骰子投出某个值的概率
          tmp[j + k] += dp[j] / 6.0;
        }
      }
      dp = tmp;
    }
    return dp;
  }
};
